attachments/whoami-omitted-retry-mutation.diff
diff --git a/cmd/gitseq-mcp/main.go b/cmd/gitseq-mcp/main.go
index a2146061a..872282ffa 100644
--- a/cmd/gitseq-mcp/main.go
+++ b/cmd/gitseq-mcp/main.go
@@ -1417,7 +1417,7 @@ func (s *mcpServer) whoami(ctx context.Context, current *room, identity *selecte
 	}
 	residentContext, cancel := context.WithTimeout(ctx, orientationTimeout)
 	defer cancel()
-	for attempt := 0; attempt < 2; attempt++ {
+	for attempt := 0; attempt < 1; attempt++ {
 		orientation, err := s.currentResidentOrientation(residentContext, current, actor.Fingerprint)
 		if err == nil {
 			return map[string]any{
